try mermaid
